---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeTypeOptions.IsEqualTo(Autodesk.Revit.DB.DirectShapeTypeOptions)
source: html/e0dfc4d7-f53d-0964-3a36-7acb3146eed8.htm
---
# Autodesk.Revit.DB.DirectShapeTypeOptions.IsEqualTo Method

Compare this object with the one supplied as argument.
 Return true if the options specified by both objects are the same.

## Syntax (C#)
```csharp
public bool IsEqualTo(
	DirectShapeTypeOptions other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.DirectShapeTypeOptions`) - the DirectShapeTypeOptions object to be compared.

## Returns
True if both objects specify the same options.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null